personal/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<title>About me | Simon Dobson</title>
<link rel="icon" href="../images/favicon.png" sizes="16x16">
<link rel="alternate" type="application/rss+xml" href="../rss.xml">
<link rel="preconnect" href="https://fonts.googleapis.com">
<link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
<link rel="stylesheet" href="https://fonts.googleapis.com/css?family=Droid+Sans+Mono|Libre+Baskerville|Montserrat|Playfair+Display|Tangerine">
<link rel="stylesheet" href="../assets/css/libretto_styles.css">
<link rel="stylesheet" href="../assets/css/baguetteBox.min.css">
<link rel="stylesheet" href="../assets/css/code.css">
<link rel="stylesheet" href="../assets/css/nikola_rst.css">
<link rel="stylesheet" href="../assets/css/nikola_ipython.css">
<link rel="stylesheet" href="https://use.fontawesome.com/releases/v5.0.13/css/all.css" integrity="sha384-DNOHZ68U8hZfKXOrtjWvjxusGo9WQnrNx2sqG0tfsghAvtVlRW3tvkXWZh58N9jp" crossorigin="anonymous">
</head>
<body>
    <!-- Navigation bar -->
    <header class="nav-bar"><div class="site-branding">
	    <h1 class="site-title">
		<a href="https://simondobson.org/" title="Simon Dobson" rel="home">Simon&nbsp;Dobson</a>
	    </h1>
	</div>
	<nav class="site-navigation" role="navigation"><div class="menu-toggle">
		<span class="mobile-site-title">Simon Dobson</span>
	    </div>
	    <ul class="menu">
<li><a href="../index.html">Home</a></li>
		    <li><a href=".">About&nbsp;me</a></li>
		    <li><a href="../research/">Research</a></li>
		    <li><a href="../development/projects/">Software</a></li>
		    <li><a href="../writing/">Writing</a></li>
		    <li><a href="contact/">Contact</a></li>
		<li>
<a href="../rss.xml"><i class="fa fa-rss"></i></a>
	    </li>
</ul></nav></header><!-- Page Header --><div class="title-block post-format-icon-pin">
	<h1>About&nbsp;me</h1>
    </div>

	<!-- Page Content -->
    <div class="site-content" role="main">
	<article class="format-standard libretto-long-form"><div class="entry-content">
		<div id="outline-container-orge0d6ba8" class="outline-2">
<h2 id="orge0d6ba8">Biography</h2>
<div class="outline-text-2" id="text-orge0d6ba8">
<p>
Simon Dobson is Professor of Computer Science in the <a href="https://www.st-andrews.ac.uk/computer-science/">School of
Computer Science</a> at the <a href="https://www.st-andrews.ac.uk">University of St Andrews</a>, and was Head of
School from 2017 – 2021. He was elected Fellow of the <a href="https://www.rse.org.uk">Royal Society
of Edinburgh</a>, Scotland&#8217;s national academy, in&nbsp;2020.
</p>

<p>
Simon works on complex and sensor systems, focusing on sensor
analytics and the modelling of complex processes – and especially
on the intersection of the two, which is sometimes called &#8220;digital
twins&#8221;. His research has generated over 150 internationally
peer-reviewed <a href="/research/publications/">publications</a>, driven by leadership roles in research
grants worth over €30M – most recently as part of a £5M
<span class="caps">EPSRC</span>-funded programme grant in the <a href="http://www.dcs.gla.ac.uk/research/S4/">Science of Sensor Systems
Software</a> He has served, amongst other activities, on the steering
committee of the <span class="caps">ACSOS</span> conference; as programme and general chairs
for the <span class="caps">IEEE</span> International Conference on Autonomic Computing; as an
associate editor of <span class="caps">ACM</span> Transactions on Autonomous and Adaptive
Systems; as a member of the executive of <a href="https://www.theiet.org/impact-society/thought-leadership/expert-panels/uk-computing-research-committee-ukcrc/"><span class="caps">UKCRC</span></a>, the expert committee
on <span class="caps">UK</span> computing research; as the chair of the <span class="caps">BCS</span> Distinguished PhD
Dissertations award panel; and on the programme committees of a wide
range of leading international conferences and specialised
workshops. He was a director and vice-president of the <a href="http://www.ercim.org/">European
Research Consortium for Informatics and Mathematics</a> from 2006 –
2009, and has served on a number of national and <span class="caps">EU</span> committees and
strategic&nbsp;initiatives.
</p>

<p>
Simon has previously worked at the <a href="https://www.stfc.ac.uk"><span class="caps">UK</span> <span class="caps">STFC</span>‘s Rutherford Appleton
Laboratory</a>; at <a href="https://www.trcd.ie">Trinity College Dublin</a> and <a href="https://www.ucd.ie"><span class="caps">UCD</span> Dublin</a> in Ireland;
and was also the founder and <span class="caps">CEO</span> of Aurium, a research-led
Dublin-based start-up company. He holds a BSc from the <a href="https://www.newcastle.ac.uk">University of
Newcastle upon Tyne</a> and DPhil from the <a href="https://www.york.ac.uk">University of York</a>, both in
computer science, is a <a href="https://www.engc.org.uk/">Chartered Engineer</a> and a Fellow of the
<a href="https://www.bcs.org.uk">British Computer Society</a>.
</p>

<p>
(See also my <a href="/short-cv.pdf">2-page</a> and <a href="/medium-cv.pdf">complete</a>&nbsp;CVs.)
</p>

<p>
<a href="/personal/contact/">Contact&nbsp;details</a>
</p>
</div>
</div>

<div id="outline-container-org8e6f711" class="outline-2">
<h2 id="org8e6f711">Other personal&nbsp;stuff</h2>
<div class="outline-text-2" id="text-org8e6f711">
<p>
Some of my <a href="/galleries/">photography</a> appears here&nbsp;occasionally.
</p>
</div>
</div>
	    </div>
	</article>
</div>

	<!-- Social sharing section -->

	<!-- Tag Section -->

	<!-- Post Navigation links -->

    <!-- Page Footer -->
    <section class="footer-sidebar clear" role="complementary"><div class="widget-block">
	    <aside class="widget"><h2 class="widget-title">Simon&nbsp;Dobson</h2>
		<div class="widget-text">Aut tace aut loquere meliora silentio</div>
	    </aside>
</div>
    </section><!-- Extra JavaScript --><!-- Site Attributions --><footer class="site-footer" role="contentinfo"><div class="site-info">
	    <p></p>
	    <p>
	      Built with free and open-source software.
	      Powered by <a href="https://getnikola.com/">Nikola</a> using a theme based on
	      <a href="https://themes.getnikola.com/v7/libretto/">Libretto</a>.
	    </p>
	    <p>
	      All content Copyright © 2010–2024 Simon Dobson and licensed under
	      <a href="https://creativecommons.org/licenses/by-nc-sa/4.0/"><span class="caps">CC</span>-<span class="caps">BY</span>-<span class="caps">NC</span>-<span class="caps">SA</span>-4.0</a>
	      unless otherwise&nbsp;noted.
	    </p>
	</div>
	<div class="social">
	    <ul class="menu"></ul>
</div>
    </footer>
</body>
</html>